---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalConnectedCurrentParam
source: html/b6d2afb8-5934-0517-5646-1a0f1c5d4333.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalConnectedCurrentParam Property

"Total Connected Current"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalConnectedCurrentParam { get; }
```